[net]
width=320
height=320
learning_rate=0.01

[conv]
batch_normalize=1
filters=32
size=3
stride=2
activation=leaky

[bottleneck]
expand=1
filters=16
skip=0
stride=1

[bottleneck]
expand=6
filters=24
skip=0
stride=2

[bottleneck]
expand=6
filters=24
skip=1
stride=1

[bottleneck]
expand=6
filters=32
skip=0
stride=2

[bottleneck]
expand=6
filters=32
skip=1
stride=1

[bottleneck]
expand=6
filters=32
skip=1
stride=1

[bottleneck]
expand=6
filters=64
skip=0
stride=2

[bottleneck]
expand=6
filters=64
skip=1
stride=1

[bottleneck]
expand=6
filters=64
skip=1
stride=1

[bottleneck]
expand=6
filters=64
skip=1
stride=1

[bottleneck]
expand=6
filters=96
skip=0
stride=1

[bottleneck]
expand=6
filters=96
skip=1
stride=1

[bottleneck]
expand=6
filters=96
skip=1
stride=1

[bottleneck]
expand=6
filters=160
skip=0
stride=2

[bottleneck]
expand=6
filters=160
skip=1
stride=1

[bottleneck]
expand=6
filters=160
skip=1
stride=1

[bottleneck]
expand=6
filters=320
skip=0
stride=1

[conv]
batch_normalize=1
filters=1280
size=1
stride=1
activation=leaky

[conv]
batch_normalize=1
filters=512
size=1
stride=1
activation=leaky

[conv_dw]
filters=1024
stride=1

[conv]
batch_normalize=1
filters=512
size=1
stride=1
activation=leaky

[conv_dw]
filters=1024
stride=1

[conv]
batch_normalize=1
filters=512
size=1
stride=1
activation=leaky

[conv_dw]
filters=1024
stride=1


[conv]
size=1
stride=1
filters=69
activation=linear

[yolo]
mask = 6,7,8
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=18

[route]
layers = -4


[conv]
batch_normalize=1
filters=256
size=1
stride=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 13

[conv]
batch_normalize=1
filters=256
size=1
stride=1
activation=leaky

[conv_dw]
filters=512
stride=1

[conv]
batch_normalize=1
filters=256
size=1
stride=1
activation=leaky

[conv_dw]
filters=512
stride=1

[conv]
batch_normalize=1
filters=256
size=1
stride=1
activation=leaky

[conv_dw]
filters=512
stride=1

[conv]
size=1
stride=1
filters=69
activation=linear

[yolo]
mask = 3,4,5
anchors = 38,108, 46,68, 53,182, 56,123, 103,58, 176,179
classes=18

[route]
layers = -4

[conv]
batch_normalize=1
filters=128
size=1
stride=1
activation=leaky

[upsample]
stride=2

[route]
layers = -1, 6

[conv]
batch_normalize=1
filters=128
size=1
stride=1
activation=leaky

[conv_dw]
filters=256
stride=1

[conv]
batch_normalize=1
filters=128
size=1
stride=1
activation=leaky

[conv_dw]
filters=256
stride=1

[conv]
batch_normalize=1
filters=128
size=1
stride=1
activation=leaky

[conv_dw]
filters=256
stride=1

[conv]
size=1
stride=1
filters=69
activation=linear

[yolo]
mask = 0,1,2
anchors = 10,13,  16,30,  33,23,  30,61,  62,45,  59,119,  116,90,  156,198,  373,326
classes=18
